数组
数组：704.二分查找
数组：27.移除元素
数组：977.有序数组的平方
数组：209.长度最小的子数组
数组：59.螺旋矩阵II
1365.有多少小于当前数字的数字
941.有效的山脉数组 （双指针）
1207.独一无二的出现次数 数组在哈希法中的经典应用
283.移动零 【数组】【双指针】
189.旋转数组
724.寻找数组的中心索引
34.在排序数组中查找元素的第一个和最后一个位置 （二分法）
922.按奇偶排序数组II
35.搜索插入位置



链表
链表：203.移除链表元素
链表：707.设计链表
链表：206.翻转链表
链表：24.两两交换链表中的节点
链表：19.删除链表的倒数第 N 个结点
链表：链表相交
链表：142.环形链表
24.两两交换链表中的节点
234.回文链表
143.重排链表【数组】【双向队列】【直接操作链表】
141.环形链表
160.相交链表




哈希表
哈希表：242.有效的字母异位词
哈希表：1002.查找常用字符
哈希表：349.两个数组的交集
哈希表：202.快乐数
哈希表：1.两数之和
哈希表：454.四数相加II
哈希表：383.赎金信
哈希表：15.三数之和
双指针法：18.四数之和
205.同构字符串:【哈希表的应用】


字符串
字符串：344.反转字符串
字符串：541.反转字符串II
字符串：替换空格
字符串：151.翻转字符串里的单词
字符串：左旋转字符串
帮你把KMP算法学个通透
字符串：459.重复的子字符串
925.长按键入 模拟匹配
0844.比较含退格的字符串【栈模拟】【空间更优的双指针】


双指针法
数组：27.移除元素
字符串：344.反转字符串
字符串：替换空格
字符串：151.翻转字符串里的单词
链表：206.翻转链表
链表：19.删除链表的倒数第 N 个结点
链表：链表相交
链表：142.环形链表
双指针：15.三数之和
双指针：18.四数之和



栈与队列
栈与队列：232.用栈实现队列
栈与队列：225.用队列实现栈
栈与队列：20.有效的括号
栈与队列：1047.删除字符串中的所有相邻重复项
栈与队列：150.逆波兰表达式求值
栈与队列：239.滑动窗口最大值
栈与队列：347.前K个高频元素


单调栈
单调栈：739.每日温度
单调栈：496.下一个更大元素I
单调栈：503.下一个更大元素II
单调栈：42.接雨水
单调栈：84.柱状图中最大的矩形


二叉树
129.求根到叶子节点数字之和
1382.将二叉搜索树变平衡 构造平衡二叉搜索树
100.相同的树 同101.对称二叉树 一个思路
116.填充每个节点的下一个右侧节点指针
二叉树遍歷
144
145
94
102
二叉树屬性
101
104
111
222
110
257
404
513
112
二叉树修改與構造
226
106
654
617
二叉搜索樹
700
98
530
501
538
二叉树共同祖先
236
235
二叉搜索树修改與構造
701
450
669
108

关于二叉树，你该了解这些！
二叉树：二叉树的递归遍历
二叉树：二叉树的迭代遍历
二叉树：二叉树的统一迭代法
二叉树：二叉树的层序遍历
二叉树：226.翻转二叉树
本周小结！（二叉树）
二叉树：101.对称二叉树
二叉树：104.二叉树的最大深度
二叉树：111.二叉树的最小深度
二叉树：222.完全二叉树的节点个数
二叉树：110.平衡二叉树
二叉树：257.二叉树的所有路径
本周总结！（二叉树）
二叉树：二叉树中递归带着回溯
二叉树：404.左叶子之和
二叉树：513.找树左下角的值
二叉树：112.路径总和
二叉树：106.构造二叉树
二叉树：654.最大二叉树
本周小结！（二叉树）
二叉树：617.合并两个二叉树
二叉树：700.二叉搜索树登场！
二叉树：98.验证二叉搜索树
二叉树：530.搜索树的最小绝对差
二叉树：501.二叉搜索树中的众数
二叉树：236.公共祖先问题
本周小结！（二叉树）
二叉树：235.搜索树的最近公共祖先
二叉树：701.搜索树中的插入操作
二叉树：450.搜索树中的删除操作
二叉树：669.修剪二叉搜索树
二叉树：108.将有序数组转换为二叉搜索树
二叉树：538.把二叉搜索树转换为累加树
二叉树：总结篇！（需要掌握的二叉树技能都在这里了）




回溯算法
組合
77
17
39
40
216
分割
131
93
子集
78
90
排列
46
47
棋盤
51
37
其他
491
332



贪心算法
簡單
455
1005
860
1221.分割平衡字符 简单贪心

中等
排序
376
738
股票
122
714
二維
135
406

難
649.Dota2参议院 有难度
區間
55
45
452
435
763
56
最大子序和
53
加油站
134
監控二叉樹
968
738




动态规划
基礎
动态规划：509.斐波那契数
动态规划：70.爬楼梯
动态规划：746.使用最小花费爬楼梯
本周小结！（动态规划系列一）
动态规划：62.不同路径
动态规划：63.不同路径II
动态规划：343.整数拆分
动态规划：96.不同的二叉搜索树

背包
动态规划：416.分割等和子集
动态规划：1049.最后一块石头的重量II
动态规划：494.目标和
动态规划：474.一和零
动态规划：完全背包总结篇
动态规划：518.零钱兑换II
动态规划：377.组合总和Ⅳ
动态规划：70.爬楼梯（完全背包版本）
动态规划：322.零钱兑换
动态规划：279.完全平方数
动态规划：139.单词拆分

打家劫舍系列：
动态规划：198.打家劫舍
动态规划：213.打家劫舍II
动态规划：337.打家劫舍III

动态规划：121.买卖股票的最佳时机 賣一次
动态规划：122.买卖股票的最佳时机II 賣多次
动态规划：123.买卖股票的最佳时机III 賣兩次
动态规划：188.买卖股票的最佳时机IV 賣k次
动态规划：309.最佳买卖股票时机含冷冻期
动态规划：714.买卖股票的最佳时机含手续费

子序列不連續
动态规划：300.最长递增子序列
动态规划：1143.最长公共子序列
动态规划：1035.不相交的线
子序列連續
动态规划：674.最长连续递增序列
动态规划：718.最长重复子数组
动态规划：53.最大子序和
編輯距離
动态规划：392.判断子序列
动态规划：115.不同的子序列
动态规划：583.两个字符串的删除操作
动态规划：72.编辑距离
回文
动态规划：647.回文子串
动态规划：516.最长回文子序列



5.最长回文子串 和647.回文子串 差不多是一样的
132.分割回文串II 与647.回文子串和 5.最长回文子串 很像
673.最长递增子序列的个数




图论
图论：797.所有可能的路径
图论：200.岛屿数量.深搜版
图论：200.岛屿数量.广搜版
图论：695.岛屿的最大面积
图论：1020.飞地的数量
图论：130.被围绕的区域
图论：417.太平洋大西洋水流问题
463.岛屿的周长 （模拟）
841.钥匙和房间 【有向图】dfs，bfs都可以
127.单词接龙 广搜



并查集
684.冗余连接 【并查集基础题目】
685.冗余连接II【并查集的应用】
模拟
657.机器人能否返回原点
31.下一个排列
位运算
1356.根据数字二进制下1的数目排序